/*********************************************************************************************************
* 模块名称：Flash.c
* 摘    要：Flash模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Flash.h"
#include "gd32f4xx_fmc.h"
#include "stdio.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static u32 s_arrFlashBuf[FLASH_SECTOR_SIZE / 4];  //Flash写入缓冲区，大小为32K字节

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitFlash
* 函数功能：初始化Flash模块
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitFlash(void)
{

}

/*********************************************************************************************************
* 函数名称：FlashWriteWord
* 函数功能：向Flash中写入字
* 输入参数：startAddr-起始地址，pBuf-待写入数据指针，len-写入数据的数量
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：输入数据一定是uint32_t的指针，即数据一定是按照4字节对齐写入的
*          写入数据时为保证之前写入的数据不被擦除，Flash读写以扇区为单位
*********************************************************************************************************/
void FlashWriteWord(uint32_t startAddr, uint32_t* pBuf, uint32_t len)
{
  u32 i;          //循环变量
  u32 sectorAddr;   //扇区地址，即起始地址startAddr所在的扇区地址
  u32 sectorOff;    //扇区内偏移地址（32位计算），即起始地址startAddr所在的扇区的偏移地址
  u32 rwAddr;     //读写地址
  u32 dataCnt;    //已写入数据量

  //计算扇区地址和扇区内偏移量
  sectorAddr = startAddr;
  sectorOff  = 0;
	
  while(0 != (sectorAddr % FLASH_SECTOR_SIZE))
  {
    sectorAddr = sectorAddr - 4;
    sectorOff++;
  }

  //解锁Flash，准备写入
  fmc_unlock();

  //已写入数据量清零
  dataCnt = 0;

  //写入Flash时需要先读取整扇区的内容到缓冲区，然后擦除一整扇区，将缓冲区修改后再写回Flash
  while(1)
  {
    //读取一整扇区的数据到缓冲区
    rwAddr = sectorAddr;
    for(i = 0; i < FLASH_SECTOR_SIZE / 4; i++)
    {
      s_arrFlashBuf[i] = *(u32*)rwAddr;
      rwAddr = rwAddr + 4;
    }
		
		if(sectorAddr == 0x08020000)							//扇区5
			fmc_sector_erase(CTL_SECTOR_NUMBER_5);
		else if(sectorAddr == 0x08040000)					//扇区6
			fmc_sector_erase(CTL_SECTOR_NUMBER_6);
		else if(sectorAddr == 0x08060000)					//扇区7
			fmc_sector_erase(CTL_SECTOR_NUMBER_7);
		else if(sectorAddr == 0x08080000)					//扇区8
			fmc_sector_erase(CTL_SECTOR_NUMBER_8);
		else if(sectorAddr == 0x080A0000)					//扇区9
			fmc_sector_erase(CTL_SECTOR_NUMBER_9);
		else if(sectorAddr == 0x080C0000)					//扇区10
			fmc_sector_erase(CTL_SECTOR_NUMBER_10);
		else if(sectorAddr == 0x080E0000)					//扇区11
			fmc_sector_erase(CTL_SECTOR_NUMBER_11);
		
    
    //修改缓冲区内的内容
    while(sectorOff < (FLASH_SECTOR_SIZE / 4))
    {
			
      //将数据保存到缓冲区
      s_arrFlashBuf[sectorOff] = pBuf[dataCnt];

      //已写入数据加一
      dataCnt++;

      //扇区内偏移量加一
      sectorOff++;

      //写入完成
      if(dataCnt >= len)
      {
        break;
      }
    }

    //扇区内偏移量清零
    sectorOff = 0;

    //将修改后的缓冲区内容写回Flash
    rwAddr = sectorAddr;
    for(i = 0; i < FLASH_SECTOR_SIZE / 4; i++)
    {
      fmc_word_program(rwAddr, s_arrFlashBuf[i]);
      rwAddr = rwAddr + 4;
    }

    //更新到下一扇区首地址
    sectorAddr = sectorAddr + FLASH_SECTOR_SIZE;

    //写入完成
    if(dataCnt >= len)
    {
      break;
    }
  }

  //Flash上锁
  fmc_lock();
}

/*********************************************************************************************************
* 函数名称：FlashReadWord
* 函数功能：从Flash读取字
* 输入参数：startAddr-起始地址（由于是字（32位）读取，因此，此地址必须为4的倍数）；pBuf-数据指针
*           len-字（32位）数，即要读取的32位数据的个数
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void FlashReadWord(uint32_t startAddr, uint32_t* pBuf, uint32_t len)
{
  u32 addr;
  u32 i;

  addr = startAddr;
  for(i = 0; i < len; i++)
  {
    pBuf[i] = *(u32*)addr;
    addr = addr + 4;
  }
}


