/*********************************************************************************************************
* 模块名称：UART5.c
* 摘    要：串口模块，包括串口模块初始化，以及中断服务函数处理，以及读写串口函数实现
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "UART5.h"
#include "gd32f470x_conf.h"
#include "Queue.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/    
static  StructCirQue  s_structUARTRecCirQue;        //接收串口循环队列
static  unsigned char s_arrRecBuf[UART5_BUF_SIZE];  //接收串口循环队列的缓冲区

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  ConfigUART(unsigned int bound);  //配置串口相关的参数，包括GPIO、RCU、USART和NVIC

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigUART
* 函数功能：配置串口相关的参数，包括GPIO、RCU、USART和NVIC
* 输入参数：bound，波特率
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static  void  ConfigUART(unsigned int bound)
{
  rcu_periph_clock_enable(RCU_GPIOA);  //使能GPIOA时钟

  //TX
  gpio_af_set(GPIOA, GPIO_AF_8, GPIO_PIN_11);
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP,GPIO_PIN_11);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_MAX,GPIO_PIN_11);

  //RX
  gpio_af_set(GPIOA, GPIO_AF_8, GPIO_PIN_12);
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE,GPIO_PIN_12);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_MAX,GPIO_PIN_12);

  //配置USART的参数
  rcu_periph_clock_enable(RCU_USART5);                  //使能串口时钟
  usart_deinit(USART5);                                 //rcu配置恢复默认值
  usart_baudrate_set(USART5, bound);                    //设置波特率
  usart_stop_bit_set(USART5, USART_STB_1BIT);           //设置停止位
  usart_word_length_set(USART5, USART_WL_8BIT);         //设置数据字长度
  usart_parity_config(USART5, USART_PM_NONE);           //设置奇偶校验位
  usart_receive_config(USART5, USART_RECEIVE_ENABLE);   //使能接收
  usart_transmit_config(USART5, USART_TRANSMIT_ENABLE); //使能发送
  usart_enable(USART5);                                 //使能串口

  usart_interrupt_enable(USART5, USART_INT_RBNE); //使能接收缓冲区非空中断
  usart_interrupt_disable(USART5, USART_INT_TBE); //使能发送缓冲区空中断
  nvic_irq_enable(USART5_IRQn, 1, 0);             //使能串口中断，设置优先级
}

/*********************************************************************************************************
* 函数名称：USART5_IRQHandler
* 函数功能：USART5中断服务函数 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void USART5_IRQHandler(void)
{
  unsigned char  uData;
  uData = usart_data_receive(USART5);
  EnQueue(&s_structUARTRecCirQue, &uData, 1);
  usart_interrupt_flag_clear(USART5, USART_INT_FLAG_RBNE);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitUART5
* 函数功能：初始化UART模块 
* 输入参数：bound,波特率
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitUART5(unsigned int bound)
{
  InitQueue(&s_structUARTRecCirQue,  s_arrRecBuf,  UART5_BUF_SIZE);
  ConfigUART(bound);
}

/*********************************************************************************************************
* 函数名称：WriteUART5
* 函数功能：写串口，即写数据到的串口发送缓冲区  
* 输入参数：pBuf，要写入数据的首地址，len，期望写入数据的个数
* 输出参数：void
* 返 回 值：成功写入数据的个数，不一定与形参len相等
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
unsigned int  WriteUART5(unsigned char *pBuf, unsigned int len)
{
  unsigned int i;

  for(i = 0; i < len; i++)
  {
    //等待上次发送完成
    while(RESET == usart_flag_get(USART5, USART_FLAG_TBE));

    //发送数据
    usart_data_transmit(USART5, pBuf[i]);
  }

  return len;
}

/*********************************************************************************************************
* 函数名称：ReadUART5
* 函数功能：读串口，即读取串口接收缓冲区中的数据  
* 输入参数：pBuf，读取的数据存放的首地址，len，期望读取数据的个数
* 输出参数：pBuf，读取的数据存放的首地址
* 返 回 值：成功读取数据的个数，不一定与形参len相等
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
unsigned int  ReadUART5(unsigned char *pBuf, unsigned int len)
{
  unsigned int rLen = 0;  //实际读取数据长度

  rLen = DeQueue(&s_structUARTRecCirQue, pBuf, len);

  return rLen;  //返回实际读取数据的长度
}

/*********************************************************************************************************
* 函数名称：DeInitUART5
* 函数功能：注销串口
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void DeInitUART5(void)
{
  usart_deinit(USART5);
}
