% 输入数据
x = [
1.755
1.779
2.146
2.285
2.36
2.398
2.631
2.814
2.964
3.23
3.425
];  % 自变量
y = [
-46.503874
-44.989158
0.255875
17.186197
27.487666
32.391657
59.360687
79.99716
101.041479
131.057392
157.691789
];  % 因变量

% 最小二乘直线拟合
p = polyfit(x, y, 1);   % 1 表示一次多项式

k = p(1);   % 斜率
b = p(2);   % 截距

% 输出
fprintf('y = %.6f * x + %.6f\n', k, b);

% 画图验证
figure;
plot(x, y, 'o'); hold on;
plot(x, polyval(p, x), '-r');
xlabel('电压值');
ylabel('温度值');
legend('原始数据','拟合直线');
grid on;
