/*********************************************************************************************************
* 模块名称：CANTop.c
* 摘    要：CAN实验应用层模块模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "CANTop.h"
#include "gd32f470x_conf.h"
#include "SysTick.h"
#include "GUITop.h"
#include "stdio.h"
#include "CAN.h"
#include "Timer.h"
#include "TerminalWidget.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static StructGUIDev s_structGUIDev;          //GUI设备结构体
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void SendProc(u32 id, char* data); //发送处理函数
static void ReadProc(void);               //读串口处理

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：SendProc
* 函数功能：发送处理函数
* 输入参数：id：发送ID，data：发送数据
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：因为键盘只有0-9，所以ID输入框是10进制数据，发送数据是字符串
*********************************************************************************************************/
static void SendProc(u32 id, char* data)
{
  u8 i;        //发送计数
  u8 sendData; //发送数据

  //校验输入地址是否为空指针
  if(NULL == data)
  {
    return;
  }

  //计算数据量
  i = 0;
  while(0 != *(data + i))
  {
    i++;
  }

  //通过CAN0将数据发送出去
  WriteCAN0(id, (u8*)data, i);

  //发送回车换行
  sendData = '\r';
  WriteCAN0(id, &sendData, 1);
  sendData = '\n';
  WriteCAN0(id, &sendData, 1);
}

/*********************************************************************************************************
* 函数名称：ReadProc
* 函数功能：读串口处理
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：每隔一段时间调用一次
*********************************************************************************************************/
static void ReadProc(void)
{
  static char s_arrReadBuf[48] = {0}; //接收缓冲区
  static u8   s_iReadCnt       = 0;   //接收计数
  static u64  s_iBeginTime     = 0;   //接收到第一个字符时的系统时间

  u8  readData;
  u64 time;

  //获取系统运行时间
  time = GetSysTime();  //ms

  //接收数据处理
  while(ReadCAN0(&readData, 1))
  {
    //记录接收到第一个字符时的系统时间
    if(0 == s_iReadCnt)
    {
      s_iBeginTime = time;
    }

    //将数据储存到缓冲区
    s_arrReadBuf[s_iReadCnt] = readData;

    //接收计数加一
    s_iReadCnt = (s_iReadCnt + 1) % (sizeof(s_arrReadBuf) / sizeof(u8));

    //接收到回车换行
    if(s_iReadCnt >= 2)
    {
      if(('\r' == s_arrReadBuf[s_iReadCnt - 2]) && ('\n' == s_arrReadBuf[s_iReadCnt - 1]))
      {
        //加上字符串结尾
        s_arrReadBuf[s_iReadCnt] = 0;

        //接收计数清零
        s_iReadCnt = 0;
        //输出到终端显示
        s_structGUIDev.showLine((char*)s_arrReadBuf);
      }
    }
  }

  //超过250毫秒还没接收到回车换行则强制更新到终端显示
  if((s_iReadCnt > 0) && ((time - s_iBeginTime) > 250))
  {
    //加上字符串结尾
    s_arrReadBuf[s_iReadCnt] = 0;

    //接收计数清零
    s_iReadCnt = 0;

    //输出到终端显示
    s_structGUIDev.showLine((char*)s_arrReadBuf);
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitCANTop
* 函数功能：初始化CAN实验应用层模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitCANTop(void)
{
  //CAN0显示
  s_structGUIDev.can = "CAN0";

  //速度显示
  s_structGUIDev.speed = "1MBps";

  //标识符显示，显示16进制数据
  s_structGUIDev.id = "0x5A5";
  
  //掩码显示，显示16进制数据
  s_structGUIDev.mask = "0xFFFFFFFF";

  //发送回调函数
  s_structGUIDev.sendCallBack = SendProc;

  //初始化UI界面设计
  InitGUI(&s_structGUIDev);
}

/*********************************************************************************************************
* 函数名称：CANTopTask
* 函数功能：CAN实验应用层模块任务
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：每隔40毫秒执行一次
*********************************************************************************************************/
void CANTopTask(void)
{
  ReadProc(); //接收串口数据并输出到终端
  GUITask();  //GUI任务
}
