/*********************************************************************************************************
* 模块名称：GD25QXX.c
* 摘    要：GD25QXX模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：注意勾选Options for Target 'Target1'->Code Generation->Use MicroLIB，否则printf无法使用                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "GD25QXX.h"
#include "SPI.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define W25Q16_PAGE_SIZE    256                            //一页的大小，256字节
#define W25Q16_SECTOR_SIZE (4 * 1024)                      //扇区大小，字节
#define W25Q16_BLOCK_SIZE  (16 * W25Q16_SECTOR_SIZE)
#define W25Q16_SIZE        (32 * W25Q16_BLOCK_SIZE)

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
const u8 byDUMMY = 0xff;

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void GD25Q16WriteEnable(void);
static void GD25Q16WaitForWriteEnd(void);
static void GD25Q16WriteStatusReg1(u16 status);
static void GD25Q16PageProgram(u8 *buf, u16 len, u32 addr);

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：GD25Q16WriteEnable
* 函数功能：写使能
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void GD25Q16WriteEnable(void)
{
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x06);
  SET_SPI_NSS();
}

/*********************************************************************************************************
* 函数名称：GD25Q16WaitForWriteEnd
* 函数功能：等待FLASH内部时序操作完成
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void GD25Q16WaitForWriteEnd(void)
{
  u8 status = 0;
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x05);
  
  do
  {
    status = GD25Q16ReadWriteDate(byDUMMY);
  }
  while((status & 0x01) == 1);
  
  SET_SPI_NSS();
}

/*********************************************************************************************************
* 函数名称：GD25Q16WriteStatusReg1
* 函数功能：写状态寄存器1 
* 输入参数：status-状态值 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void GD25Q16WriteStatusReg1(u16 status)
{
  GD25Q16WriteEnable();
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x01);
  GD25Q16ReadWriteDate(status & 0xFF);
  GD25Q16ReadWriteDate((status >> 8) & 0xFF);
  SET_SPI_NSS();
  GD25Q16WaitForWriteEnd();
}

/*********************************************************************************************************
* 函数名称：GD25Q16PageProgram
* 函数功能：页写 
* 输入参数：buf-要写的数据,len-数据长度,addr-起始地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void GD25Q16PageProgram(u8 *buf, u16 len, u32 addr)
{
  GD25Q16WriteEnable();
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x02);
  GD25Q16ReadWriteDate((addr & 0xFF0000) >> 16);
  GD25Q16ReadWriteDate((addr & 0x00FF00) >> 8);
  GD25Q16ReadWriteDate(addr & 0xFF);
  
  while (len--)
  {
    GD25Q16ReadWriteDate(*buf);
    buf++;
  }
  
  SET_SPI_NSS();
  GD25Q16WaitForWriteEnd();
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitGD25QXX
* 函数功能：GD25QXX模块初始化 
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitGD25QXX(void)
{
  InitSPI();
}

/*********************************************************************************************************
* 函数名称：W25q64_Write
* 函数功能：数据存储 
* 输入参数：buf-要写的数据,len-数据长度,addr-起始地址 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void GD25Q16Write(u8 *buf, u16 len, u32 addr)
{
  u8 pagenum;
  u8 addrbyte;  //最低八位地址
  addrbyte = addr % W25Q16_PAGE_SIZE;
  
  if (len > (W25Q16_PAGE_SIZE - addrbyte)) //跨页
  {
    GD25Q16PageProgram(buf, W25Q16_PAGE_SIZE - addrbyte, addr);//写满本页
    addr += W25Q16_PAGE_SIZE-addrbyte;
    buf += W25Q16_PAGE_SIZE-addrbyte;
    len -= W25Q16_PAGE_SIZE-addrbyte;
    pagenum = len/W25Q16_PAGE_SIZE;
    
    while (pagenum--)
    {
      GD25Q16PageProgram(buf, W25Q16_PAGE_SIZE, addr);
      addr += W25Q16_PAGE_SIZE;
      buf += W25Q16_PAGE_SIZE;
      len -= W25Q16_PAGE_SIZE;
    }
    
    GD25Q16PageProgram(buf, len, addr);
  }
  else
  {
    GD25Q16PageProgram(buf, len, addr);
  }
}

/*********************************************************************************************************
* 函数名称：GD25Q16ReadStatus
* 函数功能：读状态寄存器 
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u16 GD25Q16ReadStatus(void)
{
  u16 status=0;
  
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x05);
  status = GD25Q16ReadWriteDate(byDUMMY);
  SET_SPI_NSS();
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x35);
  status |= GD25Q16ReadWriteDate(byDUMMY) << 8;
  SET_SPI_NSS();
  
  return status;
}

/*********************************************************************************************************
* 函数名称：GD25Q16ReadDeviceID
* 函数功能：读芯片ID
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u16 GD25Q16ReadDeviceID(void)
{
  u8 DeviceID = 0;
  
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0xAB);
  GD25Q16ReadWriteDate(byDUMMY);
  GD25Q16ReadWriteDate(byDUMMY);
  GD25Q16ReadWriteDate(byDUMMY);
  DeviceID = GD25Q16ReadWriteDate(0X00);
  SET_SPI_NSS();
  
  return DeviceID;
}

/*********************************************************************************************************
* 函数名称：GD25Q16ReadJEDEID
* 函数功能：读芯片ID 
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u16 GD25Q16ReadJEDEID(void)
{
  u16 DeviceID = 0;
  
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x9F);
  GD25Q16ReadWriteDate(byDUMMY);
  DeviceID = GD25Q16ReadWriteDate(byDUMMY) << 8;
  DeviceID |= GD25Q16ReadWriteDate(byDUMMY);
  SET_SPI_NSS();
  
  return DeviceID;
}

/*********************************************************************************************************
* 函数名称：GD25Q16Read
* 函数功能：读数据
* 输入参数：buf-数据缓冲区,len-长度,addr-起始地址 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void GD25Q16Read(u8 *buf, u32 len, u32 addr)
{
  u32 i;
  
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x03);
  GD25Q16ReadWriteDate((addr & 0xFF0000) >> 16);
  GD25Q16ReadWriteDate((addr & 0x00FF00) >> 8);
  GD25Q16ReadWriteDate(addr & 0xFF);
  
  for (i = 0; i < len; i++)
  {
    buf[i] = GD25Q16ReadWriteDate(byDUMMY);
  }
  
  SET_SPI_NSS();
}

/*********************************************************************************************************
* 函数名称：GD25Q16X4KErase
* 函数功能：4K片擦除
* 输入参数：addr-起始地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void  GD25Q16X4KErase(u32 addr)
{
  GD25Q16WriteEnable();
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x20);
  GD25Q16ReadWriteDate((addr & 0xFF0000) >> 16);
  GD25Q16ReadWriteDate((addr & 0x00FF00) >> 8);
  GD25Q16ReadWriteDate(addr & 0xFF);
  SET_SPI_NSS();
  GD25Q16WaitForWriteEnd();
}

/*********************************************************************************************************
* 函数名称：GD25Q16X32KErase
* 函数功能：32K片擦除
* 输入参数：addr-起始地址 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void  GD25Q16X32KErase(u32 addr)
{
  GD25Q16WriteEnable();
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0x52);
  GD25Q16ReadWriteDate((addr & 0xFF0000) >> 16);
  GD25Q16ReadWriteDate((addr & 0x00FF00) >> 8);
  GD25Q16ReadWriteDate(addr & 0xFF);
  SET_SPI_NSS();
  GD25Q16WaitForWriteEnd();
}

/*********************************************************************************************************
* 函数名称：GD25Q16X64KErase
* 函数功能：64K片擦除 
* 输入参数：addr-起始地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void  GD25Q16X64KErase(u32 addr)
{
  GD25Q16WriteEnable();
  CLR_SPI_NSS();
  GD25Q16ReadWriteDate(0xD8);
  GD25Q16ReadWriteDate((addr & 0xFF0000) >> 16);
  GD25Q16ReadWriteDate((addr & 0x00FF00) >> 8);
  GD25Q16ReadWriteDate(addr & 0xFF);
  SET_SPI_NSS();
  GD25Q16WaitForWriteEnd();
}
