/*********************************************************************************************************
* 模块名称：TCPClientBase.h
* 摘    要：TCP客户端驱动模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _TCP_CLIENT_BASE_H
#define _TCP_CLIENT_BASE_H

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"
#include "lwip/debug.h"
#include "lwip/stats.h"
#include "lwip/tcp.h"
#include "lwip/memp.h"
#include "lwip/mem.h"
#include "LWIPComm.h"
#include "Queue.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define TCP_CLIENT_RX_BUFSIZE 1500 //定义tcp client最大接收数据长度
#define TCP_CLIENT_TX_BUFSIZE 200  //定义tcp client最大发送数据长度
#define REMOTE_PORT           8087 //定义远端主机的IP地址
#define LWIP_SEND_DATA        0x80 //定义有数据发送
#define	TCP_CLIENT_PORT       8087 //定义tcp client要连接的远端端口

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void CreateTCPClient(u8 ServerIP0, u8 ServerIP1, u8 ServerIP2, u8 ServerIP3, u16 port); //创建TCP客户端
u32  ReadTCPClient(u8* buf, u32 len);  //读TCP客户端接收数据缓冲区
u32  WriteTCPClient(u8* buf, u32 len); //TCP客户端发送数据

#endif
