/*********************************************************************************************************
* 模块名称：SliderWidget.h
* 摘    要：滑条控件模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _SLIDER_WIDGET_H_
#define _SLIDER_WIDGET_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/
//滑条控件
typedef struct
{
  u16   x0;          //起始横坐标
  u16   y0;          //起始纵坐标
  u16   width;       //宽度，宽度必须大于长度
  u16   height;      //高低，宽度必须大于长度
  u16   value;       //滑条当前位置，0-100
  void* lineImage;   //滑条横线图片，位图
  void* circleImage; //滑条圆点图片，位图
  u16   lineSize;    //滑条横线粗细，具体为2*lineSize个像素点（lineImage为NULL时使用）
  u16   lineColor;   //滑条横线颜色（lineImage为NULL时使用）
  u16   circleColor; //滑条原点颜色，圆点直径默认为控件高度（circleImage为NULL时使用）
  void* background;  //背景缓冲区，用户提供，需是静态数组
}StructSliderWidget;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
u8   CreateSliderWidget(StructSliderWidget* widget); //创建滑条控件
void ScanSliderWidget(StructSliderWidget* widget);   //滑条扫描

#endif
