% % 输入数据
% x = [
% 1.71025
% 1.7225
% 2.092875
% 2.2355
% 2.314125
% 2.35425
% 2.57125
% 2.737625
% 2.904375
% 3.139625
% 3.349
% ];  % 自变量
% y = [
% 81.76
% 82.4
% 100.1
% 106.88
% 110.66
% 112.6
% 122.9
% 130.9
% 138.85
% 150.2
% 160.15
% ];  % 因变量

% 输入数据
x = [
600
1000
1500
2000
];  % 自变量
y = [
0.326
0.368
0.387
0.478
];  % 因变量

% 最小二乘直线拟合
p = polyfit(x, y, 1);   % 1 表示一次多项式

k = p(1);   % 斜率
b = p(2);   % 截距

% 输出
fprintf('y = %.6f * x + %.6f\n', k, b);

% 画图验证
figure;
plot(x, y, 'o'); hold on;
plot(x, polyval(p, x), '-r');
xlabel('电压值');
ylabel('温度值');
legend('原始数据','拟合直线');
grid on;


