/*********************************************************************************************************
* 模块名称：MallocTop.c
* 摘    要：内存管理实验顶层模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "MallocTop.h"
#include "GUITop.h"
#include "Malloc.h"
#include "Timer.h"
#include "stdio.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define IN_MALLOC_SIZE (1024 * 10)   //内部SRAM内存申请量
#define EX_MALLOC_SIZE (1024 * 1024) //外拓SDRAM内存申请量

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static StructGUIDev s_structGUIDev;      //GUI设备结构体
static u8*          s_pMalloc = NULL;    //内存申请指针
static u8           s_iPointerPlace = 0; //0-当前指针指向内部SRAM区，1-当前指针指向外拓SDRAM

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void InSramMallcCallback(void); //从内部SRAM申请内存按键回调函数
static void ExSdramMallcCallback(void); //从外拓SDRAM申请内存按键回调函数
static void FreeCallback(void);        //内存释放按钮回调函数
static void updateMamInfoShow(u8 mem); //更新内存信息显示

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InSramMallcCallback
* 函数功能：从内部SRAM申请内存按键回调函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void InSramMallcCallback(void)
{
  //内存申请
  s_pMalloc = MyMalloc(SRAMIN, IN_MALLOC_SIZE);
  s_iPointerPlace = 0;
  printf("指针数值：0x%08X\r\n", (u32)s_pMalloc);

  //更新内存信息显示
  updateMamInfoShow(SRAMIN);
}

/*********************************************************************************************************
* 函数名称：ExSramMallcCallback
* 函数功能：从外拓SRAM申请内存按键回调函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ExSdramMallcCallback(void)
{
  //内存申请
  s_pMalloc = MyMalloc(SDRAMEX, EX_MALLOC_SIZE);
  s_iPointerPlace = 1;
  printf("指针数值：0x%08X\r\n", (u32)s_pMalloc);

  //更新内存信息显示
  updateMamInfoShow(SDRAMEX);
}

/*********************************************************************************************************
* 函数名称：FreeCallback
* 函数功能：内存释放按钮回调函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void FreeCallback(void)
{
  //内部SRAM
  if(0 == s_iPointerPlace)
  {
    //释放内存
    MyFree(SRAMIN, s_pMalloc);

    //更新内存信息显示
    updateMamInfoShow(SRAMIN);
  }

  //外部SDRAM
  else if(1 == s_iPointerPlace)
  {
    //释放内存
    MyFree(SDRAMEX, s_pMalloc);

    //更新内存信息显示
    updateMamInfoShow(SDRAMEX);
  }
}

/*********************************************************************************************************
* 函数名称：updateMamInfoShow
* 函数功能：更新内存信息显示
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void updateMamInfoShow(u8 mem)
{
  //内存使用量与剩余量
  u64 usage, free;

  //内部SRAM
  if(SRAMIN == mem)
  {
    //获取内存使用率
    usage = MemoryPerused(SRAMIN);

    //计算字节使用量
    usage = MEM1_MAX_SIZE * usage / 1000;

    //向上取整
    while(0 != (usage % IN_MALLOC_SIZE))
    {
      usage++;
    }

    //计算剩余字节数
    free = MEM1_MAX_SIZE - usage;

    //更新显示
    s_structGUIDev.updateInSRAMInfo(usage, free);
  }

  //外部SDRAM
  else if(SDRAMEX == mem)
  {
    //获取内存使用率
    usage = MemoryPerused(SDRAMEX);

    //计算字节使用量
    usage = MEM2_MAX_SIZE * usage / 1000;

    //向上取整
    while(0 != (usage % EX_MALLOC_SIZE))
    {
      usage++;
    }

    //计算剩余字节数
    free = MEM2_MAX_SIZE - usage;

    //更新显示
    s_structGUIDev.updateExSDRAMInfo(usage, free);
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitMallocTop
* 函数功能：初始化USB键盘顶层模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitMallocTop(void)
{
  //内、外两个内存池显示大小
  s_structGUIDev.inMallocSize = MEM1_MAX_SIZE;
  s_structGUIDev.exMallocSize = MEM2_MAX_SIZE;

  //回调函数
  s_structGUIDev.mallocInButtonCallback = InSramMallcCallback;
  s_structGUIDev.mallocExButtonCallback = ExSdramMallcCallback;
  s_structGUIDev.freeButtonCallback = FreeCallback;

  //初始化UI界面设计
  InitGUI(&s_structGUIDev);
}

/*********************************************************************************************************
* 函数名称：MallocTopTask
* 函数功能：内存管理实验顶层模块任务
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void MallocTopTask(void)
{
  //上次添加波形点
  static u64 s_iLastTime = 0;

  //内部SRAM和外部SDRAM使用量
  u16 inSramUse, exSdramUse;

  //每隔250ms添加一次内存使用量波形显示
  if((GetSysTime() - s_iLastTime) >= 250)
  {
    s_iLastTime = GetSysTime();
    inSramUse = MemoryPerused(SRAMIN);
    exSdramUse = MemoryPerused(SDRAMEX);
    s_structGUIDev.addMemoryWave(inSramUse / 10, exSdramUse / 10);
  }

  //GUI任务
  GUITask();
}
