/*********************************************************************************************************
* 模块名称：BreathLEDTop.c
* 摘    要：呼吸灯实验顶层模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "BreathLEDTop.h"
#include "gd32f470x_conf.h"
#include "TLILCD.h"
#include "JPEG.h"
#include "BMP.h"
#include "SliderWidget.h"
#include "BreathLED.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static StructSliderWidget s_structSlider;    //滑条控件
static u16 s_arrSliderBackground[20 * 1024]; //滑条背景缓冲区

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void DisplayBackground(void);                                       //绘制背景

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称：DisplayBackground
* 函数功能：绘制背景
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：调用之前要确保LCD方向为横屏
*********************************************************************************************************/
static void DisplayBackground(void)
{
  //背景图片控制结构体
  StructJpegImage backgroundImage;
  //初始化backgroundImage
  backgroundImage.image = (unsigned char*)s_arrJpegBackgroundImage;
  backgroundImage.size  = sizeof(s_arrJpegBackgroundImage) / sizeof(unsigned char);
  //解码并显示图片
  DisplayJPEGInFlash(&backgroundImage, 0, 0);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitBreathLEDTop
* 函数功能：初始化呼吸灯实验顶层模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：背景缓冲区要大于width x height x 16
*********************************************************************************************************/
void InitBreathLEDTop(void)
{
  //LCD横屏显示
  LCDDisplayDir(LCD_SCREEN_HORIZONTAL);
  LCDClear(LCD_COLOR_BLUE);

  //绘制背景
  DisplayBackground();

  //创建滑条控件
  s_structSlider.x0          = 100;                                      //起始横坐标
  s_structSlider.y0          = 300;                                      //起始纵坐标
  s_structSlider.width       = 600;                                      //宽度
  s_structSlider.height      = 30;                                       //高度
  s_structSlider.value       = 50;                                       //滑条预设置（0-100）
  s_structSlider.lineImage   = NULL;                                     //线条不使用刷图片方式
  s_structSlider.circleImage = (void*)s_arrBmpSliderCircleImage30x30x32; //滑条圆点图片
  s_structSlider.lineSize    = 3;                                        //横线宽度为6
  s_structSlider.lineColor   = 0xFDCA;                                   //线条颜色
  s_structSlider.circleColor = 0xFDCA;                                   //圆点颜色
  s_structSlider.background  = (void*)s_arrSliderBackground;               //背景缓冲区
  CreateSliderWidget(&s_structSlider);                                   //创建滑条控件
}

/*********************************************************************************************************
* 函数名称：BreathLEDTopTask
* 函数功能：呼吸灯实验任务
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void BreathLEDTopTask(void)
{
  u32 period;

  //滑动条扫描
  ScanSliderWidget(&s_structSlider);

  //获取呼吸灯周期
  period = 2500 * s_structSlider.value / 100;
  if(period < 50)
  {
    period = 50;
  }

  //呼吸灯任务
  BreathLEDTask(period);
}
