/*********************************************************************************************************
* 模块名称：U16Queue.h
* 摘    要：U16Queue模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2022 Leyutek. All rights reserved.)
* 完成日期：2022年01月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _U16_QUEUE_H_
#define _U16_QUEUE_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
//定义循环队列结构体
typedef struct
{
  signed short front;       //头指针，队非空时指向队头元素
  signed short rear;        //尾指针，队非空时指向队尾元素的下一个位置
  signed short bufLen;      //队列的总容量
  signed short elemNum;     //当前队列中的元素的数量
  unsigned short *pBuffer;  //循环队列的缓冲区
}StructU16CirQue;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitU16Queue(StructU16CirQue* pQue, unsigned short* pBuf, signed short len);  //初始化队列
void  ClearU16Queue(StructU16CirQue* pQue);                                         //清队列
unsigned char    U16QueueEmpty(StructU16CirQue* pQue);                   //判断队列是否为空，1为空，0为非空
signed short   U16QueueLength(StructU16CirQue* pQue);                    //返回队列中元素个数，即为队列的长度
signed short   EnU16Queue(StructU16CirQue* pQue, unsigned short* pInput, signed short len);  //入队len个元素
signed short   DeU16Queue(StructU16CirQue* pQue, unsigned short* pOutput, signed short len); //出队len个元素

#endif
