/*********************************************************************************************************
* 模块名称：TCPServerBase.h
* 摘    要：TCP服务器驱动模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _TCP_SERVER_BASE_H_
#define _TCP_SERVER_BASE_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"
#include "lwip/debug.h"
#include "lwip/stats.h"
#include "lwip/tcp.h"
#include "lwip/memp.h"
#include "lwip/mem.h"
#include "LWIPComm.h"
#include "Queue.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define TCP_SERVER_BUF_SIZE   256  //定义tcp server最大发送、接收缓冲区长度
#define TCP_SERVER_PORT       8088 //定义tcp server的端口

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/
//TCP服务区客户端列表
typedef enum
{
  TCP_SERVER_CLIENT0 = 0, //客户端0，必须从0开始
  TCP_SERVER_CLIENT1,     //客户端1
  TCP_SERVER_CLIENT2,     //客户端2
  TCP_SERVER_CLIENT3,     //客户端3
  TCP_SERVER_CLIENT4,     //客户端4
  TCP_SERVER_CLIENT_NUM,  //客户端数量
  TCP_SERVER_CLIENT_ALL,  //列表内所有客户端
  TCP_SERVER_CLIENT_NULL  //无效客户端
}EnumTCPClientList;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void CreateTCPServer(void);                        //创建TCP服务器
void CloseTCPServer(void);                         //关闭TCP服务器
u32  ReadTCPServer(u32 client, u8* buf, u32 len);  //读TCP服务器接收数据缓冲区
u32  WriteTCPServer(u32 client, u8* buf, u32 len); //TCP服务器发送数据
u32  GetClientIP(EnumTCPClientList client);        //通过客户端列表获取客户端IP

#endif 
