/*********************************************************************************************************
* 模块名称：RTC.c
* 摘    要：RTC模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2022年01月01日
* 内    容：
* 注    意：                                                           
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "RTC.h"
#include "gd32f470x_conf.h"
#include <stdio.h>

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
//星期字符串
static const char* s_arrWeek[] = 
{
  "星期一",
  "星期二",
  "星期三",
  "星期四",
  "星期五",
  "星期六",
  "星期天",
};

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
enum Day     //星期
{ Mon = 1, Tues, Wed, Thur, Fri, Sat, Sun };

enum months  //月份
{ JAN = 1, FEB, MAR, APR, MAY, JUN, JUL, AUG, SEP, OCT, NOV, DEC };
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigRTCCLK(void);  //配置RTC时钟
static u32  DecToBcd(u32 dec); //10进制转BCD码
static u32  BcdToDec(u32 bcd); //BCD码转10进制
static void ConfigRTC(void);	   //配置RTC，包括预分频值和计数值

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigRTCCLK
* 函数功能：配置RTC时钟
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ConfigRTCCLK(void)
{
  //配置时钟源为外部LXTAL
  rcu_osci_on(RCU_LXTAL);                          //使能外部低速时钟
  
  if(rcu_osci_stab_wait(RCU_LXTAL) == SUCCESS)     //外部晶振已经稳定
  {
    rcu_rtc_clock_config(RCU_RTCSRC_LXTAL);
  } 
  
  rcu_periph_clock_enable(RCU_RTC);                //使能RTC外设时钟
  rtc_register_sync_wait();							           //等待RTC寄存器与APB时钟同步
}


/*********************************************************************************************************
* 函数名称：DecToBcd
* 函数功能：10进制转BCD码
* 输入参数：dec：10进制数
* 输出参数：void
* 返 回 值：BCD码
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static u32 DecToBcd(u32 dec)
{
  u32 hBit, lBit, bcd;
  dec = dec % 100;
  hBit = (dec / 10) & 0x0F;
  lBit = (dec % 10) & 0x0F;
  bcd = (hBit << 4) | lBit;
  return bcd;
}

/*********************************************************************************************************
* 函数名称：BcdToDec
* 函数功能：BCD码转10进制
* 输入参数：bcd：BCD码
* 输出参数：void
* 返 回 值：10进制
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static u32 BcdToDec(u32 bcd)
{
  u32 hBit, lBit, dec;
  hBit = (bcd >> 4) & 0x0F;
  lBit = (bcd >> 0) & 0x0F;
  dec = hBit * 10 + lBit;
  return dec;
}

/*********************************************************************************************************
* 函数名称：ConfigRTC
* 函数功能：配置RTC，包括预分频值和计数值
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ConfigRTC(void)
{
  //RTC初始化结构体
  rtc_parameter_struct rtc_initpara;

  //写入前准备
  rcu_periph_clock_enable(RCU_PMU); //使能PMU时钟
  pmu_backup_write_enable();        //允许对备份域寄存器的写访问
  ConfigRTCCLK();                   //配置RTC时钟
  rcu_periph_clock_enable(RCU_RTC); //使能RTC时钟
  rtc_register_sync_wait();         //等待同步

  //配置RTC参数
	rtc_current_time_get(&rtc_initpara);
  rtc_initpara.year           = DecToBcd(2022);
  rtc_initpara.month          = JAN;
  rtc_initpara.date           = DecToBcd(1);
  rtc_initpara.day_of_week    = Sat;
  rtc_initpara.hour           = DecToBcd(18);   //设置初始时间为18:00:00
  rtc_initpara.minute         = DecToBcd(00);
  rtc_initpara.second         = DecToBcd(00);
  rtc_initpara.factor_asyn    = 127;
  rtc_initpara.factor_syn     = 255;
  rtc_initpara.am_pm          = RTC_AM;
  rtc_initpara.display_format = RTC_24HOUR;
  if(SUCCESS != rtc_init(&rtc_initpara))
  {
    printf("SetRTC: 配置RTC失败\r\n");
    while(1){}
  }

  //退出配置
  rtc_register_sync_wait();   //等待同步
  pmu_backup_write_disable(); //禁止对备份域寄存器的写访问
}

/*********************************************************************************************************
* 函数名称：RTCGetDate
* 函数功能：获取当前日期
* 输入参数：返回当前日期
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void RTCGetDate(u32* year, u32* month, u32* date, u32* week)
{
  //RTC参数结构体
  rtc_parameter_struct rtc_initpara;

  //获取当前时间
  rtc_current_time_get(&rtc_initpara);

  //返回日期
  *year = 2000 + BcdToDec(rtc_initpara.year);
  *month = rtc_initpara.month;
  *date = BcdToDec(rtc_initpara.date);
  *week = rtc_initpara.day_of_week;
}

/*********************************************************************************************************
* 函数名称：RTCGetTime
* 函数功能：获取当前时间
* 输入参数：返回当前时间
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void RTCGetTime(u32* hour, u32* min, u32* sec)
{
  //RTC参数结构体
  rtc_parameter_struct rtc_initpara;

  //获取当前时间
  rtc_current_time_get(&rtc_initpara);

  //返回时间
  *hour = BcdToDec(rtc_initpara.hour);
  *min = BcdToDec(rtc_initpara.minute);
  *sec = BcdToDec(rtc_initpara.second);
}

/*********************************************************************************************************
* 函数名称：RTCPrintTime
* 函数功能：打印当前时间
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void RTCPrintTime(void)
{
  u32 year, month, date, week, hour, min, sec;

  //获取时间日期
  RTCGetDate(&year, &month, &date, &week);
  RTCGetTime(&hour, &min, &sec);

  //打印输出
  printf("当前时间：%d-%02d-%02d %s %02d:%02d:%02d\r\n", year, month, date, s_arrWeek[week - 1], hour, min, sec);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitRTC
* 函数功能：初始化RTC模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitRTC(void)
{  
  ConfigRTC();
}
