/*********************************************************************************************************
* 模块名称：SysTick.c
* 摘    要：SysTick模块，包含SysTick模块初始化以及微秒和毫秒级延时函数
**********************************************************************************************************

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "sysTick.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量定义
*********************************************************************************************************/
static  __IO  unsigned int s_iTimDelayCnt = 0;
static uint8_t  s_i2msFlag  = FALSE;    //将2ms标志位的值设置为FALSE
static uint8_t  s_i1secFlag = FALSE;    //将1s标志位的值设置为FALSE

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void TimDelayDec(void); //延时计数

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：TimDelayDec
* 函数功能：延时计数  
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：在SysTick中断服务函数SysTick_Handler中调用
*********************************************************************************************************/
static  void TimDelayDec(void)
{
  if(s_iTimDelayCnt != 0) //延时计数器的数值不为0
  {
    s_iTimDelayCnt--;     //延时计数器的数值减1
  }
}

/*********************************************************************************************************
* 函数名称：SysTick_Handler
* 函数功能：SysTick中断服务函数 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：
*********************************************************************************************************/
void  SysTick_Handler(void)
{
  static int s_iCnt2 = 0;
  static int s_iCnt1000 = 0;

  s_iCnt2++;
  if(s_iCnt2 >= 2)
  {
    s_i2msFlag = TRUE;
    s_iCnt2 = 0;
  }

  s_iCnt1000++;
  if(s_iCnt1000 >= 1000)
  {
    s_i1secFlag = TRUE;
    s_iCnt1000 = 0;
  }
  TimDelayDec();  //延时计数函数
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitSysTick
* 函数功能：初始化SysTick模块  
* 输入参数：void  
* 输出参数：void  
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：SystemCoreClock / 1000      1ms中断一次（计数1000次为1s，每计一次位1/1000s=1ms）
*           SystemCoreClock / 4000      0.25ms中断一次（计数4000次为1s，每计一次位1/4000s=0.25ms）
*           SystemCoreClock / 100000    10us中断一次（计数100000次为1s，每计一次位1/100000s=10us）
*           SystemCoreClock / 1000000   1us中断一次（计数1000000次为1s，每计一次位1/1000000s=1us）
*********************************************************************************************************/
void InitSysTick( void )
{
  if (SysTick_Config(SystemCoreClock / 1000U)) //配置系统滴答定时器1ms中断一次  
  { 
    while(1)  //错误发生的情况下，进入死循环
    {
      
    }
  }
}

/*********************************************************************************************************
* 函数名称：DelayNms
* 函数功能：毫秒级延时函数  
* 输入参数：nms
* 输出参数：void
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：
*********************************************************************************************************/
void  DelayNms(__IO unsigned int nms)
{
  s_iTimDelayCnt = nms;         //将延时计数器s_iTimDelayCnt的数值赋为nms
  
  SysTick->VAL = SysTick->LOAD; //避免第一个ms不准
                              
  while(s_iTimDelayCnt != 0)    //延时计数器的数值为0时，表示延时了nms，跳出while语句
  {  
    
  }    
}

/*********************************************************************************************************
* 函数名称：DelayNus
* 函数功能：微秒级延时函数  
* 输入参数：nus
* 输出参数：void
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：
*********************************************************************************************************/
void  DelayNus(__IO unsigned int nus)    
{
  unsigned int s_iTimCnt = nus;       //定义一个变量s_iTimCnt作为延时计数器，赋值为nus
  unsigned short i;                   //定义一个变量作为循环计数器

  while(s_iTimCnt != 0)               //延时计数器s_iTimCnt的值不为0
  {
    for(i = 0; i < 46; i++)           //空循环，产生延时功能
    {
    
    }
    
    s_iTimCnt--;                      //成功延时1us，变量s_iTimCnt减1
  }    
}


uint8_t  Get2msFlag(void) //获取2ms标志位的值
{
  return s_i2msFlag; //返回2ms标志位的值
}

uint8_t  Get1secFlag(void) //获取1s标志位的值
{
  return s_i1secFlag; //返回1s标志位的值
}

void Clr2msFlag(void) //清除2ms标志位
{
  s_i2msFlag = FALSE; //将2ms标志位的值设置为FALSE
}
void Clr1secFlag(void) //清除1s标志位
{
  s_i1secFlag = FALSE; //将1s标志位的值设置为FALSE
}