/*********************************************************************************************************
* 模块名称：TouchKeyTop.h
* 摘    要：电容触摸按键实验顶层模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "TouchKeyTop.h"
#include "gd32f470x_conf.h"
#include "TLILCD.h"
#include "JPEG.h"
#include "GUITerminal.h"
#include "TouchKey.h"
#include "stdio.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static char s_arrStringBuf[64]; //字符串转换缓冲区

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void DisplayBackground(void);     //绘制背景
static void KeyDownCallback(u64 upTime); //按键按下回调函数
static void KeyUpCallback(u64 downTime); //按键抬起回调函数

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称：DisplayBackground
* 函数功能：绘制背景
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：调用之前要确保LCD方向为横屏
*********************************************************************************************************/
static void DisplayBackground(void)
{
  //背景图片控制结构体
  StructJpegImage backgroundImage;

  //初始化backgroundImage
  backgroundImage.image = (unsigned char*)s_arrJpegBackgroundImage;
  backgroundImage.size  = sizeof(s_arrJpegBackgroundImage) / sizeof(unsigned char);

  //解码并显示图片
  DisplayJPEGInFlash(&backgroundImage, 0, 0);
}

/*********************************************************************************************************
* 函数名称：KeyDownCallback
* 函数功能：按键按下回调函数
* 输入参数：upTime：按键抬起时长（ms）
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void KeyDownCallback(u64 upTime)
{
  //字符串转换
  sprintf(s_arrStringBuf, "Key down: up time = %lld ms\r\n", upTime);

  //输出到终端显示
  ShowStringLineInGUITerminal(s_arrStringBuf);

  //打印到串口显示
  printf("%s", s_arrStringBuf);
}

/*********************************************************************************************************
* 函数名称：KeyUpCallback
* 函数功能：按键抬起回调函数
* 输入参数：downTime：按键按下时长（ms）
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void KeyUpCallback(u64 downTime)
{
  //字符串转换
  sprintf(s_arrStringBuf, "Key up: down time = %lld ms\r\n", downTime);

  //输出到终端显示
  ShowStringLineInGUITerminal(s_arrStringBuf);

  //打印到串口显示
  printf("%s", s_arrStringBuf);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitTouchKeyTop
* 函数功能：初始化电容触摸按键实验顶层模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitTouchKeyTop(void)
{
  //LCD竖屏显示
  LCDDisplayDir(LCD_SCREEN_VERTICAL);
  LCDClear(LCD_COLOR_BLUE);

  //绘制背景
  DisplayBackground();

  //创建终端
  InitGUITerminal();
  ClearGUITerminal();

  //终端输出“Touch Key Test”
  ShowStringLineInGUITerminal("Touch Key Test");
}

/*********************************************************************************************************
* 函数名称：TouchKeyTopTask
* 函数功能：电容触摸按键实验任务
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void TouchKeyTopTask(void)
{
  //触摸按键扫描
  ScanTouchKey(KeyDownCallback, KeyUpCallback);
}
