/*********************************************************************************************************
* 模块名称：Keyboard.c
* 摘    要：USB键盘驱动模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：记得勾选“C99”模式，否则编译会报错
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Keyboard.h"
#include "gd32f470x_conf.h"
#include "drv_usb_hw.h"
#include "standard_hid_core.h"
#include "drv_usbd_int.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
//HID相关变量
static usb_core_driver s_structHIDKeyboard;
static hid_fop_handler s_structFopHandler;

//键盘键值缓冲区
static u8 s_arrKeyValue[8];  //键值缓冲区
static u8 s_arrKeyEmpty = 1; //缓冲区为空标志位

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：HidPreConfig
* 函数功能：HID预配置，用于初始化按键、键盘之类的
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：因为在GUIKeyBoard中已经对键盘进行配置，所以此处无需初始化
*********************************************************************************************************/
static void HidPreConfig (void)
{
  
}

/*********************************************************************************************************
* 函数名称：HidDataProcess
* 函数功能：HID数据处理，用于发送按键数据
* 输入参数：udev：USB设备
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void HidDataProcess(usb_dev *udev)
{
  u32 i;

  //获取HID句柄
  standard_hid_handler *hid = (standard_hid_handler *)udev->dev.class_data[USBD_HID_INTERFACE];

  //若上次传输已完成则上报键值
  if(hid->prev_transfer_complete)
  {
    //缓冲区非空
    if(1 != s_arrKeyEmpty)
    {
      //标记缓冲区为空
      s_arrKeyEmpty = 1;

      //依次复制键值到HID缓冲区
      for(i = 0; i < HID_IN_PACKET; i++)
      {
        hid->data[i] = s_arrKeyValue[i];
        s_arrKeyValue[i] = 0;
      }

      //上报键值
      hid_report_send(udev, hid->data, HID_IN_PACKET);
    }
  }
}

/*********************************************************************************************************
* 函数名称：USBFS_WKUP_IRQHandler
* 函数功能：USBFS唤醒中断服务函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void USBFS_WKUP_IRQHandler(void)
{
  if(s_structHIDKeyboard.bp.low_power)
  {
    #ifndef USE_IRC48M
      rcu_pll48m_clock_config(RCU_PLL48MSRC_PLLQ);
      rcu_ck48m_clock_config(RCU_CK48MSRC_PLL48M);
    #else
      
      //配置内部48MHz晶振
      rcu_osci_on(RCU_IRC48M);
      while (SUCCESS != rcu_osci_stab_wait(RCU_IRC48M)) {}
      rcu_ck48m_clock_config(RCU_CK48MSRC_IRC48M);
    #endif

    rcu_periph_clock_enable(RCU_USBFS);
    usb_clock_active(&s_structHIDKeyboard);
  }

  exti_interrupt_flag_clear(EXTI_18);
}

/*********************************************************************************************************
* 函数名称：USBFS_IRQHandler
* 函数功能：USBFS中断服务函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void USBFS_IRQHandler(void)
{
  usbd_isr(&s_structHIDKeyboard);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitKeyboard
* 函数功能：初始化USB键盘驱动
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*          1、USB时钟使用内部48MHz
*          2、使用USBFS，而不是USBHS，本驱动中删除了USBHS相关部分，若需要配置USBHS，请参考GD官方Demo
*          3、烧录完成后需重新插拔才能检测到USB键盘，否则程序会卡死在初始化阶段
*********************************************************************************************************/
void InitKeyboard(void)
{
  //配置HID句柄
  s_structFopHandler.hid_itf_config = HidPreConfig;
  s_structFopHandler.hid_itf_data_process = HidDataProcess;

  //USB预配置
  usb_gpio_config(); //配置GPIO
  usb_rcu_config();  //使能RCU时钟
  
  
  //HID注册
  hid_itfop_register (&s_structHIDKeyboard, &s_structFopHandler);

  //USB初始化
  usbd_init (&s_structHIDKeyboard, USB_CORE_ENUM_FS, &hid_desc, &usbd_hid_cb);
  usb_intr_config();

  //配置CTC
#ifdef USE_IRC48M
    rcu_periph_clock_enable(RCU_CTC);
    ctc_config();
    
#endif

  //标记缓冲区为空
  s_arrKeyEmpty = 1;
}

/*********************************************************************************************************
* 函数名称：SendKeyVal
* 函数功能：发送键值给电脑
* 输入参数：keyFunc：控制键
*          --bit0：Left Control是否按下，按下为1
*          --bit1：Left Shift  是否按下，按下为1
*          --bit2：Left Alt    是否按下，按下为1
*          --bit3：Left GUI（Windows键） 是否按下，按下为1
*          --bit4：Right Control是否按下，按下为1
*          --bit5：Right Shift 是否按下，按下为1
*          --bit6：Right Alt   是否按下，按下为1
*          --bit7：Right GUI   是否按下，按下为1
*          key0-key6：普通按键键值，最多支持6个按键
* 输出参数：void
* 返 回 值：0-成功，1-上次传输未完成
* 创建日期：2021年07月01日
* 注    意：USB-HID上报按键键值时固定为8个字节，其中第一个字节为特殊按键，第二个字节必须是0，剩下的就是普通按键键值
*          最多支持同时上报6个普通按键
*********************************************************************************************************/
u8 SendKeyVal(u8 keyFunc, u8 key0, u8 key1, u8 key2, u8 key3, u8 key4, u8 key5)
{
  u8 ret;
  
  //若是上次传输完成则开启新一次传输
  if(1 == s_arrKeyEmpty)
  {
    //将键值保存到发送缓冲区
    s_arrKeyValue[0] = keyFunc;
    s_arrKeyValue[1] = 0;
    s_arrKeyValue[2] = key0;
    s_arrKeyValue[3] = key1;
    s_arrKeyValue[4] = key2;
    s_arrKeyValue[5] = key3;
    s_arrKeyValue[6] = key4;
    s_arrKeyValue[7] = key5;

    //上报键值缓冲区非空
    s_arrKeyEmpty = 0;
    
    ret = 0;
  }
  else
  {
    ret = 1;
  }
  
  //上报键值
  s_structFopHandler.hid_itf_data_process(&s_structHIDKeyboard);

  return ret;
}

