/*********************************************************************************************************
* 模块名称：I2S.h
* 摘    要：I2S音频驱动模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _I2S_H_
#define _I2S_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/
//数据长度定义
typedef enum
{
  DATA_LEN_16 = 16,
  DATA_LEN_24 = 24,
  DATA_LEN_32 = 32,
}EnumI2SDataLen;

//通道长度定义
typedef enum
{
  CH_LEN_16 = 16,
  CH_LEN_32 = 32,
}EnumI2SChLen;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitI2S(void);                                                 //初始化I2S音频驱动
u32  I2SConfig(u32 fs, EnumI2SDataLen dataLen, EnumI2SChLen chLen); //配置I2S
u16  I2SReadWrite16(u16 data);                  //I2S读写16位数据
u32  I2SReadWrite24(u32 data);                  //I2S读写24位数据
u32  I2SReadWrite32(u32 data);                  //I2S读写32位数据
void I2SSendData16ByDMA(u16* dataBuf, u32 len); //I2S使用DMA发送16位数据
void I2SReadData16ByDMA(u16* dataBuf, u32 len); //I2S使用DMA接收16位数据
u32  I2STransmitState(void);                    //获取发送状态

void I2SDualDMATransmit16(u16* dataBuf1, u16* dataBuf2, u32 len); //
void I2SDualDMATransmit32(u32* dataBuf1, u32* dataBuf2, u32 len); //
u32  I2SGetTransmitNotUsedMemoryAddr(void);                       //
void I2SEndDMATransmit(void);                                     //
void I2SDualDMAReceive16(u16* dataBuf1, u16* dataBuf2, u32 len); //
u32  I2SGetReceiveNotUsedMemoryAddr(void); //
void I2SEndDMAReceive(void); //

#endif
