/*********************************************************************************************************
* 模块名称：WM8978.h
* 摘    要：WM8978音频驱动模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _WM8978_H_
#define _WM8978_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define WM8978_ADDR 0x1A //WM8978的器件地址,固定为0x1A
 
#define EQ1_80Hz    0x00
#define EQ1_105Hz   0x01
#define EQ1_135Hz   0x02
#define EQ1_175Hz   0x03

#define EQ2_230Hz   0x00
#define EQ2_300Hz   0x01
#define EQ2_385Hz   0x02
#define EQ2_500Hz   0x03

#define EQ3_650Hz   0x00
#define EQ3_850Hz   0x01
#define EQ3_1100Hz  0x02
#define EQ3_14000Hz 0x03

#define EQ4_1800Hz  0x00
#define EQ4_2400Hz  0x01
#define EQ4_3200Hz  0x02
#define EQ4_4100Hz  0x03

#define EQ5_5300Hz  0x00
#define EQ5_6900Hz  0x01
#define EQ5_9000Hz  0x02
#define EQ5_11700Hz 0x03

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
u8   InitWM8978(void);                                //WM8978初始化
u8   WM8978WriteReg(u8 reg, u16 val);                 //写寄存器
u16  WM8978ReadReg(u8 reg);                           //读寄存器
void WM8978ADDACfg(u8 dacen, u8 adcen);               //DAC/ADC配置
void WM8978InputCfg(u8 micen, u8 lineinen, u8 auxen); //输入通道配置
void WM8978OutputCfg(u8 dacen, u8 bpsen);             //WM8978 输出配置
void WM8978MICGain(u8 gain);                          //MIC增益设置
void WM8978LineinGain(u8 gain);                       //Line in增益设置
void WM8978AUXGain(u8 gain);                          //PWM音频增益设置
void WM8978I2SCfg(u8 fmt, u8 len);                    //设置I2S工作模式
void WM8978HPvolSet(u8 voll, u8 volr);                //设置耳机左右声道音量
void WM8978SPKvolSet(u8 volx);                        //设置喇叭音量
void WM89783DSet(u8 depth);                           //设置3D环绕声
void WM8978EQ3DDir(u8 dir);                           //设置EQ/3D作用方向

#endif
