/*********************************************************************************************************
* 模块名称：JPEG.h
* 摘    要：JPEG显示模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _JPEG_H_
#define _JPEG_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/
typedef struct
{
  u8* image;   //图片首地址
  u32 readCnt; //读取位置
  u32 size;    //图片大小
  u32 x0;      //起始横坐标
  u32 y0;      //起始纵坐标
}StructJpegImage;

//主屏幕背景图片
extern const u8 s_arrJpegBackgroundImage[37701];

//写入地址行编辑控件获得焦点时的背景图片
extern const u8 s_arrJpegWriteAddrHasFocusImage290x50x24[12928];

//写入地址行编辑控件无焦点时的背景图片
extern const u8 s_arrJpegWriteAddrNoFocusImage290x50x24[12000];

//写入数据行编辑控件有焦点时的背景图片
extern const u8 s_arrJpegWriteDataHasFocusImage290x50x24[13239];

//写入数据行编辑控件无焦点时的背景图片
extern const u8 s_arrJpegWriteDataNoFocusImage290x50x24[11883];

//读取地址行编辑控件有焦点时的背景图片
extern const u8 s_arrJpegReadAddrHasFocusImage210x50x24[14119];

//读取地址行编辑控件无焦点时的背景图片
extern const u8 s_arrJpegReadAddrNoFocusImage210x50x24[12932];

//读取长度行编辑控件有焦点时的背景图片
extern const u8 s_arrJpegReadLenHasFocusImage210x50x24[13876];

//读取长度行编辑控件无焦点时的背景图片
extern const u8 s_arrJpegReadLenNoFocusImage210x50x24[12998];

//终端背景图片
extern const u8 s_arrJpegTerminalImage430x270x24[17373];

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitJPEG(void);                                                               //初始化JPEG模块
void DisplayJPEGInFlash(StructJpegImage* image, u32 x0, u32 y0); //指定位置绘制JPEG图片


#endif
