/*********************************************************************************************************
* 模块名称：ADC.c
* 摘    要：ADC模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "ADC.h"
#include "gd32f470x_conf.h"
#include "SysTick.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigADC0(void); //配置ADC0

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigADC0
* 函数功能：配置ADC0
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ConfigADC0(void)
{
  //配置ADC时钟
  adc_clock_config(ADC_ADCCK_PCLK2_DIV6);

  //使能RCU相关时钟
  rcu_periph_clock_enable(RCU_ADC0);  

  //所有ADC独立工作
  adc_sync_mode_config(ADC_SYNC_MODE_INDEPENDENT);

  //配置ADC0
  adc_deinit();                                                       //复位ADC0
  adc_special_function_config(ADC0, ADC_SCAN_MODE, DISABLE);          //禁用ADC扫描
  adc_special_function_config(ADC0, ADC_CONTINUOUS_MODE, DISABLE);    //禁用连续采样
  adc_dma_mode_disable(ADC0);                                         //禁用DMA
  adc_resolution_config(ADC0, ADC_RESOLUTION_12B);                    //规则组配置，12位分辨率
  adc_data_alignment_config(ADC0, ADC_DATAALIGN_RIGHT);               //右对齐
  adc_channel_length_config(ADC0, ADC_REGULAR_CHANNEL, 1);            //规则组长度为1，即ADC通道数量为1
	adc_software_trigger_enable(ADC0, ADC_REGULAR_CHANNEL);             //规则组设置软件触发

  //ADC0过采样配置，左移4位后ADC分辨率扩展到16位，连续采256次后求和(过采样要花3ms，时间有点长)
  adc_oversample_mode_config(ADC0, ADC_OVERSAMPLING_ALL_CONVERT, ADC_OVERSAMPLING_SHIFT_4B, ADC_OVERSAMPLING_RATIO_MUL256);
  adc_oversample_mode_enable(ADC0);

  //使能内部温度传感器以及内部参考电压通道
  adc_channel_16_to_18(ADC_TEMP_VREF_CHANNEL_SWITCH, ENABLE);

  //设置内部温度传感器通道采样顺序
  adc_regular_channel_config(ADC0, 0, ADC_CHANNEL_16, ADC_SAMPLETIME_480);

  //ADC0使能
  adc_enable(ADC0);

  //延时等待10ms
  DelayNms(10);

  //使能ADC0校准
  adc_calibration_enable(ADC0);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitADC
* 函数功能：初始化ADC模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitADC(void)
{
  ConfigADC0();  //ADC0
}

/*********************************************************************************************************
* 函数名称：GetInTempADC
* 函数功能：获取CPU温度ADC转换结果
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：如果使用过采样处理那么ADC分辨率将由原来的12位扩展到16位
*********************************************************************************************************/
u16 GetInTempADC(void)
{
  u16 adc;

  //规则组软件触发
  adc_software_trigger_enable(ADC0, ADC_REGULAR_CHANNEL);

  //等待ADC转换完成
  while(!adc_flag_get(ADC0, ADC_FLAG_EOC));

  //获取规则组ADC转换结果
  adc = adc_regular_data_read(ADC0);

  return adc;
}
